# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce%20_schema.png](attachment:e_commerce%20_schema.png)

### Load Required Libraries

In [1]:
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [2]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Manzoor@17061998")
# creating a cursor object
cursorObject = connection.cursor()

### You are required to create a database named 'e_commerce'

In [3]:
cursorObject.execute("CREATE DATABASE e_commerce")

In [4]:
connection.close()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [5]:
import mysql.connector
import pandas as pd

connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Manzoor@17061998",
                                     database = 'e_commerce')
 
## creating a cursor object
cursorObject = connection.cursor()

In [6]:
table_creation_query = """ create table supplier(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10));

                          create table customer (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));

                          create table category (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID));

                          create table product (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));

                          create table product_details (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL, PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));

                          create table `order` (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));
                          
                          create table `order rating` (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))
                          """
                    
                             
                  
# Executing the query
cursorObject.execute(table_creation_query)
cursorObject.close()

True

In [7]:
import mysql.connector
import pandas as pd

connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Manzoor@17061998",
                                     database = 'e_commerce')
 
## creating a cursor object
cursorObject = connection.cursor()

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [8]:
# insert into "supplier" table
insert_cust_details = """INSERT INTO supplier (SUPP_ID , SUPP_NAME, SUPP_CITY, SUPP_PHONE) 
                       VALUES (%s, %s, %s, %s)"""

val = [(1,'Rajesh Retails', 'Delhi', 1614322387),
       (2,'Appario','Mumbai', 1000614322),
       (3,'Knome products','Banglore', 1432245789),
       (4,'Bansal Retials', 'Kochi',144332457),
       (5,'Mittal Ltd.', 'Lakhnow',789456532)]
   
cursorObject.executemany(insert_cust_details, val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [9]:
# insert into "customer" table
insert_cust_details = """INSERT INTO customer (CUS_ID , CUS_NAME ,CUS_PHONE , CUS_CITY , CUS_GENDER) 
                       VALUES (%s, %s, %s, %s, %s)"""

val = [(1, 'AAKASH',99999999, 'DELHI', 'M'),
       (2,'AMAN',9785463215, 'NOIDA','M'),
       (3, 'NEHA',9999999998, 'MUMBAI', 'F'),
       (4,'MEGHA', 9994562399, 'KOLKATA', 'F'),
       (5, 'PULKIT',7895999999, 'LUCKNOW' ,'M'),]
   
cursorObject.executemany(insert_cust_details, val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [10]:
# insert into "categoty" table
insert_cust_details = """INSERT INTO category (CAT_ID , CAT_NAME) 
                       VALUES (%s, %s)"""

val = [(1, 'BOOKS'),
       (2,'GAMES'),
       (3, 'GROCERIES'),
       (4,'ELECTRONICS'),
       (5, 'CLOTHES'),]
   
cursorObject.executemany(insert_cust_details, val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [12]:
insert_cust_details = """INSERT INTO product (PRO_ID ,PRO_NAME,PRO_DESC,CAT_ID) 
                       VALUES (%s,%s,%s,%s)"""

val = [(1, 'GTA V','DFJDJFDJFDJFDJFJF',2),
       (2,'TSHIRT','DFDFJDFJDKFD',5),
       (3, 'ROG LAPTOP','DFNTTNTNTERND',4),
       (4,'OATS','REURENTBTOTH',3),
       (5, 'HARRY POTTER','NBEMCTHTJTH',1),]
   
cursorObject.executemany(insert_cust_details, val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [13]:
# insert into "product_details" table
insert_cust_details = """INSERT INTO product_details (PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE) 
                       VALUES (%s,%s,%s,%s)"""

val = [(1, 1,2,1500),
       (2,3,5,30000),
       (3, 5,1,3000),
       (4,2,3,2500),
       (5,4,1,1000),]
   
cursorObject.executemany(insert_cust_details, val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [14]:
# insert into "orders" table
insert_cust_details = """INSERT INTO `order` (ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID) 
                       VALUES (%s,%s,%s,%s,%s)"""

val = [(20, 1500,'2021-10-12',3,5),
       (25,30500,'2021-09-16',5,2),
       (26,2000,'2021-10-05',1,1),
       (30,3500,'2021-08-16',4,3),
       (50,2000,'2021-10-06',2,1,),]
   
cursorObject.executemany(insert_cust_details, val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [15]:
# insert into "rating" table
insert_cust_details = """INSERT INTO `order rating` (RAT_ID,CUS_ID,SUPP_ID,RAT_RATSTARS) 
                       VALUES (%s,%s,%s,%s)"""

val = [(1, 2,2,4),
       (2,3,4,3),
       (3,5,1,5),
       (4,1,3,2),
       (5,4,5,4),]
   
cursorObject.executemany(insert_cust_details, val)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [16]:
question_3 = """ select c.CUS_GENDER, count(c.CUS_ID) from customer as c inner join
(select CUS_ID,ORD_AMOUNT from `order` where ORD_AMOUNT >=3000) as o
on c.CUS_ID = o.CUS_ID  group by c.CUS_GENDER
"""

cursorObject.execute(question_3)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output,columns=['Cusotmer Gender','No of Customer'])
output_df

  Cusotmer Gender  No of Customer
0               M               1
1               F               1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [17]:
question_4 = """select s2.CUS_ID,s2.PRO_ID,s2.PROD_ID,s2.ORD_ID, prod.PRO_NAME from product as prod right join 
                (select p.PRO_ID,o.PROD_ID,o.ORD_ID,o.CUS_ID from product_details as p right join
                (Select PROD_ID,ORD_ID,CUS_ID from `order` where CUS_ID =2) as o
                on p.PROD_ID = o.PROD_ID) as s2 
                on s2.PRO_ID = prod.PRO_ID
             """

cursorObject.execute(question_4)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output,columns=['CUS_ID','PRO_ID','PROD_ID','ORD_ID','PRO_NAME'])
output_df

   CUS_ID  PRO_ID  PROD_ID  ORD_ID PRO_NAME
0       2       1        1      50    GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [18]:
#PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE
#supplier (SUPP_ID , SUPP_NAME, SUPP_CITY, SUPP_PHONE

question_5 = """
            select s.SUPP_NAME, s1.No_of_product from supplier as s inner join
            (select SUPP_ID, count(PRO_ID) as No_of_product from product_details group by SUPP_ID having count(PRO_ID) >1) as s1
            on s1.SUPP_ID = s.SUPP_ID
             """

cursorObject.execute(question_5)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Supplier Name', 'No of Product Can Supply'])
output_df

    Supplier Name  No of Product Can Supply
0  Rajesh Retails                         2

### Q6) Find the category of the product whose order amount is minimum.

In [ ]:
#`order` (ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID)
#product_details (PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE) 
#product (PRO_ID ,PRO_NAME,PRO_DESC,CAT_ID) 

question_6 = """ 
              select pr.PRO_NAME,s2.amount  from product as pr inner join 
              (select p.PRO_ID,s1.amount from product_details as p inner join  
              (select o.PROD_ID, min(o.ORD_AMOUNT) as amount  from `order` as o) as s1 
              on p.PROD_ID = s1.PROD_ID ) as s2
              on pr.PRO_ID = s2.PRO_ID
             """

cursorObject.execute(question_6)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Product Name', 'Order Amount'])
output_df

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [22]:
#`order` (ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID)
#product_details (PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE) 
#product (PRO_ID ,PRO_NAME,PRO_DESC,CAT_ID) 

question_7 = """ 
             select s2.PRO_ID,pr.PRO_NAME,s2.ORD_DATE from product as pr inner join
             (select p.PROD_ID,s1.ORD_DATE, p.PRO_ID from product_details as p inner join     
             (Select PROD_ID,ORD_DATE from `order` 
             where ORD_DATE >'2021-10-05') as s1
             on p.PROD_ID = s1.PROD_ID ) as s2
             on pr.PRO_ID = s2.PRO_ID
             """

cursorObject.execute(question_7)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output,columns=['Product ID','Product Name', 'Order Date'] )
output_df

   Product ID Product Name  Order Date
0           4         OATS  2021-10-12
1           1        GTA V  2021-10-06

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [ ]:
#`order` (ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID) 
#product_details (PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE) 
#supplier (SUPP_ID , SUPP_NAME, SUPP_CITY, SUPP_PHONE
#`order rating` (RAT_ID,CUS_ID,SUPP_ID,RAT_RATSTARS)
#customer (CUS_ID , CUS_NAME ,CUS_PHONE , CUS_CITY , CUS_GENDER) 

question_8 = """ 
             select s4.SUPP_ID,s4.SUPP_NAME,s4.ValueOfProduct,s4.NoOfProduct,s4.RAT_RATSTARS,c.CUS_NAME from customer as c right join   
             (select s3.SUPP_ID,s3.SUPP_NAME,s3.PROD_ID, s3.ValueOfProduct,s3.NoOfProduct,r.RAT_RATSTARS,r.CUS_ID from `order rating` as r right join 
             (Select s2.SUPP_ID,s.SUPP_NAME,s2.PROD_ID, s2.ValueOfProduct,s2.NoOfProduct from supplier as s inner join
             (select p.SUPP_ID,s1.PROD_ID, sum(s1.ORD_AMOUNT) as ValueOfProduct,count(p.PROD_ID) as NoOfProduct from product_details as p inner join  
             (select PROD_ID,ORD_AMOUNT from `order` as o) as s1
             on p.PROD_ID = s1.PROD_ID
             group by p.SUPP_ID) as s2
             on s.SUPP_ID = s2.SUPP_ID ) as s3
             on r.SUPP_ID= s3.SUPP_ID ) as s4
             on c.CUS_ID = s4.CUS_ID
              
             order by s4.ValueOfProduct DESC  limit 3
             
             """

cursorObject.execute(question_8)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output,columns=['Suppler ID','Suppler Name','Value of Products','Number of Product','Rating','Customer who Rated'])
output_df

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [24]:
#customer (CUS_ID , CUS_NAME ,CUS_PHONE , CUS_CITY , CUS_GENDER) 

question_9 = """ 
             select CUS_NAME,CUS_GENDER from customer 
             where CUS_NAME like 'A%' or CUS_NAME like '%A'
             """

cursorObject.execute(question_9)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=["Custmer Name",'Gender'])
output_df

  Custmer Name Gender
0       AAKASH      M
1         AMAN      M
2         NEHA      F
3        MEGHA      F

### Q10) Display the total order amount of the male customers.

In [25]:
#customer (CUS_ID , CUS_NAME ,CUS_PHONE , CUS_CITY , CUS_GENDER) 
#`order` (ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID) 

question_10 = """ 
             select s1.CUS_GENDER, sum(ORD_AMOUNT) as Total_Amount from `order` as o 
             inner join 
             (select CUS_ID,CUS_GENDER from customer where CUS_GENDER ='M') as s1
             on
             o.CUS_ID = s1.CUS_ID
             group by s1.CUS_GENDER
             """

cursorObject.execute(question_10)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output,columns=["Customer's Gender","Total Order Amount"])
output_df

  Customer's Gender Total Order Amount
0                 M              34500

### Q11) Display all the Customers left outer join with  the orders

In [26]:
#customer (CUS_ID , CUS_NAME ,CUS_PHONE , CUS_CITY , CUS_GENDER) 
#`order` (ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID) 

question_11 = """ 
             Select * from customer as c 
             left outer join
             `order` as o
             on
             c.CUS_ID = o.CUS_ID
             """

cursorObject.execute(question_11)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output,columns=['CUS_ID' , 
                                         'CUS_NAME' ,
                                         'CUS_PHONE' , 
                                         'CUS_CITY' , 
                                         'CUS_GENDER',
                                         'ORD_ID',
                                         'ORD_AMOUNT',
                                         'ORD_DATE',
                                         'CUS_ID',
                                         'PROD_ID'])
output_df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID
0,1,AAKASH,99999999,DELHI,M,26,2000,2021-10-05,1,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,3,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,4,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,5,2

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)